app/controllers/playlists_controller.rb

  def index
    @playlists = Playlist.all
---
SELECT * FROM "playlists"

  def show
    @playlist = Playlist.find(params[:id])
---
SELECT * FROM "playlists" WHERE ("playlists"."id" = 1)

  def edit
    @playlist = Playlist.find(params[:id])
---
SELECT * FROM "playlists" WHERE ("playlists"."id" = 2010)

  def create
    @playlist = Playlist.new(params[:playlist])

    respond_to do |format|
      if @playlist.save
---
INSERT INTO "playlists" ("created_at", "title", "updated_at", "time") VALUES('2010-05-16 22:42:57', 'Playlist Title!', '2010-05-16 22:42:57', NULL)

  def destroy
    @playlist = Playlist.find(params[:id])
    @playlist.destroy
---
SELECT * FROM "playlists" WHERE ("playlists"."id" = 1)
DELETE FROM "playlists" WHERE "id" = 1

  def start
	puts "start()"

	address = Base64.encode64( Time.now.usec.to_s ).scan( /[A-z]/ ).join
	@playlist = Playlist.new()
	@playlist.title = params[:playlist][:title].empty? ? "Unnamed Playlist" : params[:playlist][:title]
	@playlist.time = Time.now
	@playlist.address = address

	@playlist.save
---
INSERT INTO "playlists" ("address", "created_at", "title", "updated_at", "time") VALUES('Sun May 16 18:14:34 -0500 2010', '2010-05-16 23:14:34', 'asdfasdf', '2010-05-16 23:14:34', '2010-05-16 23:14:34')