app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT * FROM "songs"

  def show
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 0)

  def edit
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 3)

  def update
    @song = Song.find(params[:id])

    respond_to do |format|
      if @song.update_attributes(params[:song])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 3)
UPDATE "songs" SET "updated_at" = '2010-05-15 23:29:16', "submitter_name" = 'Zach', "art_filename" = '', "album" = '' WHERE "id" = 3

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT * FROM "songs" WHERE ("songs"."id" = 1)
DELETE FROM "songs" WHERE "id" = 1

  def viewer
    if params[:address]
      session[:playlist_address] = params[:address]
	end

	valid_playlists = Playlist.all.select{ |playlist| playlist.address == session[:playlist_address] }
---
SELECT * FROM "playlists"

  def playlist_generate
	@current_track_idx = params[:id]
	@song_list = Song.all.select{ |song| song.address == session[:playlist_address] }
---
SELECT * FROM "songs"

  def player_generate
    current_track_idx = params[:id]
	@player = params[:player].to_s
	puts "Player: #{@player}\n";

	@filename = ""

	@song_list = Song.all.select{ |song| song.address == session[:playlist_address] }
---
SELECT * FROM "songs"